/*
Copyright (c) 2014, Ross Evan Johnson All rights reserved.

Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:

1) Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.

2) Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.

3) Neither the name of chess-tournament-pairing nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*/


    //cout << " rnd=" << rnd;

    tab = roundRobinPairings[x].find('\t', tab+1);
    ASSERT(tab != string::npos);
    string pairings = roundRobinPairings[x].substr(tab+1);
    for (size_t y = 1; ; ++y) {
      const size_t p1 = atoi(pairings.c_str());
      const size_t dash = pairings.find('-');
      ASSERT(dash != string::npos);
      const size_t p2 = atoi(pairings.substr(dash+1).c_str());
      //cout << " p1=" << p1;
      //cout << " p2=" << p2;
      if (p1 == player) {
        //cout << " FOUND";
        ASSERT(opponent == 0 && color == '*');
        opponent = p2;
        board = y;
        color = 'W';
      }
      if (p2 == player) {
        //cout << " FOUND";
        ASSERT(opponent == 0 && color == '*');
        opponent = p1;
        board = y;
        color = 'B';
      }
      const size_t space = pairings.find(' ', dash+1);
      //cout << " space=" << space << endl;
      if (space == string::npos)
        break;
      pairings = pairings.substr(space+1);
    }
  }
  ASSERT(1 <= opponent && opponent != player && opponent <= competitors);
  ASSERT(1 <= board && board <= int(competitors/2));
  ASSERT(color == 'W' || color == 'B');
  //cout << BR"done with pairing" << endl;

  const size_t rSize = sizeof(roundRobinReversals)/sizeof(*roundRobinReversals);
  bool isReversed = false;
  for (size_t x = 0; x < rSize; ++x) {
    //cout << BR << roundRobinReversals[x];
    //	size	round	windraw	reversals
    size_t tab = roundRobinReversals[x].find('\t');
    ASSERT(tab != string::npos);
    const size_t size = atoi(roundRobinReversals[x].c_str()+tab+1);
    if (size != competitors) continue;

    tab = roundRobinReversals[x].find('\t', tab+1);
    ASSERT(tab != string::npos);
    const size_t rnd = atoi(roundRobinReversals[x].c_str()+tab+1);

    tab = roundRobinReversals[x].find('\t', tab+1);
    ASSERT(tab != string::npos);
    const size_t withdraw = atoi(roundRobinReversals[x].c_str()+tab+1);
    if (withdraw != withdrawnPlayer) continue;

    tab = roundRobinReversals[x].find('\t', tab+1);
    ASSERT(tab != string::npos);
    string reversals = roundRobinReversals[x].substr(tab+1);
    if (reversals.size() > 0) for (;;) {
      const size_t p1 = atoi(reversals.c_str());
      const size_t dash = reversals.find('-');
      ASSERT(dash != string::npos);
      const size_t p2 = atoi(reversals.substr(dash+1).c_str());
      if (p1 == player && p2 == opponent) {
        ASSERT(!isBye && withdrawnPlayer != competitors);
        ASSERT(round >= rnd);
        ASSERT(!isReversed);
        color = 'W';
        isReversed = true;
      }
      if (p2 == player && p1 == opponent) {
        ASSERT(!isBye && withdrawnPlayer != competitors);
        ASSERT(round >= rnd);
        ASSERT(!isReversed);
        color = 'B';
        isReversed = true;
      }
      const size_t space = reversals.find(' ', dash+1);
      if (space == string::npos)
        break;
      reversals = reversals.substr(space+1);
    }
  }
  //cout << BR"done with color"BR << endl;
}

struct Player
{
  bigint tmt_id;  // input ignored; used for debugging: tournament number (all players must be the same)
  bigint sec_id;  // input ignored; used for debugging: section number (all players must be the same)
  character trn_type;  // type of tournament: S=swiss, M=match, R=round robin, D=double round robin, 2=double round swiss
  smallint rnd;  // round number 1 to N (all players must have the same round)
  integer board_num;  // input board hint; output final board placement (lowest board is same as input)
  character board_color;  // input color (W=white/bye or B=black) hint; output final color

  integer uscf_id;  // used for debugging: USCF member number
  integer play_id;  // unique identifier for each player (may be USCF member number or other database ID, but not zero)
  text player_name;  // input ignored; used for debugging: player's name
  smallint reentry;  // unique identifier for player reentries (suggest always zero if no reentries)
  integer team_id;  // primary team identifier for prizes and a performance optimization for determining if team block is pairable
  text team_name;  // input ignored; used for debugging: player's primary team name
  integerVector teammates;  // list of player IDs for all teammates (player can have more than one team block; all non-pairing requests (rule 28T) are handled by specifying a team ID, which is not the same as a player ID; if two players have the same team ID in each of their lists, then we avoid pairing them)
  textVector opponents;  // list of opponents already played (in round order); each opponent is a string combining the play_id and reentry separated by an underscore; byes and non-played games are not included

  real score;  // total points from prior rounds (zero for first round)
  smallint rating;  // USCF (or assigned) rating (zero for unrated unless assigned)
  boolean is_unrated;  // whether player is unrated (always use false in an unrated section)
  text use_rating;  // whether section is rated (uscf) or unrated (none)
  smallint provisional; // total number of rated games played before this tournament; may not be in supplement yet, so must get from USCF website or player; 4+ means player already has enough games to get at least a provisional rating, so we worry less about giving a bye to this unrated player in a 4-round event (rules 28L2 & 28L5)
  double rand;  // random value to break ties for ranking players with same score and rating - or for choosing lots on round-robin pairings (must be unique and the same across rounds)
  boolean bye_house;  // house player that should receive bye (half or zero) when odd number of players to pair
  boolean bye_request;  // requested bye (half or zero) for this round?
  smallint unplayed_count;  // total unplayed games for all rounds, full-point assigned (prior rounds), half-point requested (all rounds), and zero-point byes (used for rules 28L2 and 28L5 to determine whether players will have enough games to get a rating)
  smallint half_bye_count;  // total half byes and forfeit wins for all rounds, taken or committed (for rule 28L4)
  smallintVector bye_rounds;  // list of rounds with requested byes (past, current, and future), half point or zero point

  text due_color;  // input ignored; output due color: W=white to equalize, B=black to equalize, w=white to alternate, b=black to alternate, x=neither
  charVector color_history;  // list of assigned colors in prior rounds, W=white, B=black, otherwise neither (f=full point, h=half point, z=zero point); 'f' is used for rule 28L3
  charVector played_colors;  // like color history, but only W and B, not unplayed games
  char first_color;  // color of top player on top board in first round (rules 28J,29E2): W=white, B=black
  smallint multiround;  // number of rounds in a row with same opponent (used to implement multiple games per round)

  boolean paired;  // true if already paired manually (which will not be repaired, but may change board)
  text warn_codes;  // output warning codes (safe to ignore)
  character game_result;  // input ignored; used for debugging: results for current round (blank=unknown)
  integer rank;  // input ignored; used for debugging: player rank by score group and rating starting at 1
  integerVector teammate_ranks;  // input ignored; used for debugging: list of teammate ranks
  integerVector opponent_ranks;  // input ignored; used for debugging: list of prior opponents' ranks
};

ostream &operator<< (ostream &out, const Player &p)
{
  return out
	<< "tmt_id=" << p.tmt_id
	<< " sec_id=" << p.sec_id
	<< " rnd=" << p.rnd
	<< " board_num=" << p.board_num
	<< " board_color=" << p.board_color
	<< " play_id=" << p.play_id
	<< " uscf_id=" << p.uscf_id
	<< " player_name=" << p.player_name
	<< " reentry=" << p.reentry
	<< " team_id=" << p.team_id
	<< " team_name=" << p.team_name
	<< " teammates=" << p.teammates
	<< " opponents=" << p.opponents
	<< " score=" << p.score
	<< " rating=" << p.rating
	<< " is_unrated=" << p.is_unrated
	<< " use_rating=" << p.use_rating
	<< " rand=" << p.rand
	<< " bye_request=" << p.bye_request
	<< " unplayed_count=" << p.unplayed_count
	<< " half_bye_count=" << p.half_bye_count
	<< " bye_rounds=" << p.bye_rounds
	<< " due_color=" << p.due_color
	<< " color_history=" << p.color_history
	<< " played_colors=" << p.played_colors
	<< " first_color=" << p.first_color
	<< " multiround=" << p.multiround
	<< " paired=" << p.paired
	<< " warn_codes=" << p.warn_codes
	<< " game_result=" << p.game_result
	<< " rank=" << p.rank
	<< " teammate_ranks=" << p.teammate_ranks
	<< " opponent_ranks=" << p.opponent_ranks
	;
}

// sort predicate for players (and boards)
bool operator< (const Player &x, const Player &y)
{
  ASSERT(x.rand != y.rand);
  return (x.play_id == BYE_ID) < (y.play_id == BYE_ID) || ((x.play_id == BYE_ID) == (y.play_id == BYE_ID)
	&& (x.bye_request < y.bye_request || (x.bye_request == y.bye_request
	&& (x.paired < y.paired || (x.paired == y.paired
	&& (x.score > y.score || (x.score == y.score
	&& (x.rating > y.rating || (x.rating == y.rating
	&& (x.rand < y.rand || (x.rand == y.rand  // tie breaker for same ratings
	&& (x.play_id < y.play_id || (x.play_id == y.play_id  // handle rare case when random numbers match
	&& (x.reentry < y.reentry  // handle rare case when random numbers match
	))))))))))))));
}
bool operator> (const Player &x, const Player &y)	{ return y < x; }
bool operator!= (const Player &x, const Player &y)	{ return x < y || y < x; }
bool operator== (const Player &x, const Player &y)	{ return !(x != y); }
bool operator<= (const Player &x, const Player &y)	{ return !(x > y); }
bool operator>= (const Player &x, const Player &y)	{ return !(x < y); }

typedef vector<Player> PlayerVector;  // no byes (i.e. play_id != 0)
typedef sizeVector IndexVector;
typedef set<size_t> IndexSet;
const size_t invalidIndex = -1;  // invalid array index

ostream &operator<< (ostream &out, const IndexVector &a)
{
  for (size_t x = 0; x < a.size(); ++x)
    out << (x == 0 ? '{' : ',') << a[x];
  if (a.size() > 0) out << '}';
  return out;
}

typedef int64_t CostValue;
#define MaxCostValue	LLONG_MAX
struct Cost {
  // potential problems in order of significance (most to least)
  // lower values are better (zero is best)
  // comments give relevant USCF pairing rules
  CostValue byeChoice;			// 22C, 29K
  CostValue byeAgain;			// 28L3
  CostValue playersMeetTwice;		// 27A1, 28S1, 28S2, 29C2
  CostValue cantPairPlayers;		// 27A1, 29C2, 29K, 29L
  CostValue teamBlocks2;		// 28N, 28N1, 28T, 29C2
  CostValue unequalScores;		// 27A2, 29A, 29B
  CostValue teamBlocks;			// 28N, 28N1, 28T, 29C2
  CostValue cantPairTeams;		// 28N, 28N1, 28T, 29C2, 29K, 29L
  CostValue byeAfterHalf;		// 28L4
  CostValue lowestScoreBye;		// 28L2, 28L5
  CostValue lowestRatedBye;		// 28L2, 28L5
  CostValue oddPlayerUnrated;		// 29D1
  CostValue oddPlayerMultipleGroups;	// 29D2
  CostValue interchange200;		// 27A3, 29C, 29D, 29E5
  CostValue transpose200;		// 27A5, 29C, 29D, 29E
  CostValue colorImbalance;		// 27A4, 29E4
  CostValue colorRepeat3;		// 29E5f
  CostValue interchange80;		// 27A3, 29D, 29E5
  CostValue transpose80;		// 27A5, 29C, 29D, 29E
  CostValue colorAlternate;		// 27A5
  CostValue interchange0;		// 27A3, 29D, 29E5
  CostValue transpose0;			// 27A5, 29C, 29D, 29E
  CostValue pairingCard;		// 28A, 28B, 29A
  CostValue reversedColors;		// 28J 29E
  CostValue boardOverlap;		// 28J
  CostValue boardOrder;			// 28J
  Cost (void) { ASSERT(MaxCostValue > UINT_MAX); memset(this, 0, sizeof(*this)); }
  size_t players;			// for debugging/printing
  bool IsZero (void) const { Cost z; z.players = this->players; return (memcmp(this, &z, sizeof(z)) == 0); }
};

#define COST_BEGIN	byeChoice
bool operator< (const Cost &c1, const Cost &c2)
{
  for (size_t x = 0; x < sizeof(c1)/sizeof(c1.COST_BEGIN); ++x) {
    if ((&c1.COST_BEGIN)[x] < (&c2.COST_BEGIN)[x])
      return true;
    else if ((&c1.COST_BEGIN)[x] > (&c2.COST_BEGIN)[x])
      return false;
  }
  return false;
}
bool operator> (const Cost &x, const Cost &y)	{ return y < x; }
bool operator>= (const Cost &x, const Cost &y)	{ return !(x < y); }
bool operator<= (const Cost &x, const Cost &y)	{ return !(y < x); }
bool operator== (const Cost &x, const Cost &y)	{ return !(x < y || y < x); }
